// let -test
let a = 1;
if (a === 1) {
  let b = 2;
  console.log(b);
  if (b === 2) {
    console.log("наслідується");
  }
}
if (b === 2) console.log("It`s good");
// var -test
if (a === 1) {
  var c = 2;
  console.log(c);
  if (c === 2) {
    console.log("наслідується");
  }
}
if (c === 2) {
  console.log("It`s good");
}
/*
тобто в данному випадку змінна  b задана за допомогою let буде діяти тільки в 
блоці if та усiх блоках нижчого рівня які наслідуються? 

А змінна c задана за допомогою var буде діяти також в 
блоці if та усiх блоках нижчого рівня які наслідуються, 
а також в усьому коді що знаходиться нижче від місця де ця змінна задавалась?
*/
